console.log('before timer');

setTimeout(() => console.log('inside callback'), 0); // Изпълнява се след 2 sec

console.log('after timer');

// Въпреки, че нашият код изглежда линеен и редовете трябва да се изпълнят последователно,
// чак след 2 секунди браузърът е готов да се отпечата текста

// Когато сложим за секунди 0, inside callbacka се появява веднага, но отново е най-отдолу, 
// защото за да може да се изпълни асинхронния код, първо трябва да е приключил нашият синхронен код.
// Интерпретаторът на JS е еднотредов и трябва първо да се освободи нишката от кода, който в момента изпълняваме.
// 